Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/L08.tmx
Source language: en_us
Languages: zh_cn

source: Four
zh_cn: 第四章

source: Moore and Rizzoli sat sweating in the car, warm air from the AC vent.
zh_cn: 莫拓森和芮黎真坐在车里，汗流浃背，可空调里吹出的风居然是热的。

source: They'd been stuck in traffic for ten minutes, and the car was getting no cooler.
zh_cn: 他们已经堵在车流中十分钟了，车内越来越热。

source: Tax payers get what they pay for, said Rizzoli. "And this car's a piece of junk."
zh_cn: “那么多税白交了！”芮黎真抱怨道，“这辆车也真够垃圾。”

source: Moore shut off the AC and rolled down his window.
zh_cn: 莫拓森关掉空调，摇下身边的车窗。

source: The odor of hot pavement and auto exhaust blew into the car.
zh_cn: 路面蒸腾的热浪混合着汽车尾气扑面而来。

source: Already he was bathed in perspiration.
zh_cn: 他全身已经湿透，仿佛刚用汗水洗了个澡。

source: He didn't know how Rizzoli could stand keeping her blazer on; he had shed his jacket the minute they'd stepped out of Pilgrim Medical Center and were enveloped in a heavy blanket of humidity.
zh_cn: 他真佩服芮黎真还继续穿着外套。他的夹克早就脱掉了，他们从培瑞医疗中心一出来，就被包裹在一团浓重的湿气之中。他知道她一定也很热，能看到她上唇上挂着亮晶晶的汗珠。

source: He knew she must be feeling the heat, because he saw sweat glistening on her upper lip, a lip that had probably never made the acquaintance of lipstick.
zh_cn: 她的嘴唇想必很少和口红打交道吧。

source: Rizzoli was not bad-looking, but while other women might smooth on makeup or clip on earrings, Rizzoli seemed determined to downplay her own attractiveness.
zh_cn: 芮黎真长的并不难看，不过其他女性会化化妆、戴些耳饰什么的，可她却似乎在刻意掩饰自己的魅力。

source: She wore grim dark suits that did not flatter her petite frame, and her hair was a careless mop of black curls.
zh_cn: 她穿着不适合她娇小身材的黑色套装，未经修饰的黑色卷发乱蓬蓬一团。

source: She was who she was, and either you accepted it or you could just go to hell.
zh_cn: 她就是她，要么接受这样的她，要么就滚到一边儿去吧。

source: He understood why she'd adopted that up-yours attitude; she probably needed it to survive as a female cop.
zh_cn: 他理解她这种我行我素的态度，一个女人要在警察这行干下去，很不容易。

source: Rizzoli was, above all, a survivor.
zh_cn: 芮黎真却坚持下来了。

source: Just as Catherine Cordell was a survivor.
zh_cn: 柯瑟琳也坚持下来了。

source: But Dr. Cordell had evolved a different strategy: Withdrawal. Distance.
zh_cn: 但她发展出了一种不同的策略：逃避、拒人于千里之外。

source: During the interview, he'd felt as though he were looking at her through frosted glass, so detached had she seemed.
zh_cn: 在刚才的会面中，她的面前像是挡了一层毛玻璃，他无法看到她的情绪变化。

source: It was that detachment that irked Rizzoli. "There's something wrong with her," she said."Something's missing in the emotions department."
zh_cn: 芮黎真对她的这种无动于衷大感恼火，“她一定有什么问题，感情机能缺失了。”

source: She's a trauma surgeon. She's trained to keep her cool.
zh_cn: “她是创伤外科医生，保持冷静是她的职业素养。”

source: There's cool, and then there's ice.
zh_cn: “她那样不叫冷静，冰山还差不多。

source: Two years ago she was tied down, raped, and almost gutted.
zh_cn: 两年前，她被绑在床上，被强奸，还几乎被开肠破肚。

source: And she's so friggin' calm about it now.
zh_cn: 现在她却能如此镇静地面对这些往事。

source: It makes me wonder.
zh_cn: 我难以理解。”

source: Moore braked for a red light and sat staring at the grid locked intersection.
zh_cn: 红灯亮了，莫拓森踩下刹车，瞪着前方堵得水泄不通的十字路口。

source: Sweat trickled down the small of his back. He did not function well in the heat; it made him feel sluggish and stupid.
zh_cn: 汗水从腰背上不停地滴落，他最怕热，这样的天气让他感到惫懒和迟钝。

source: Hey, said Rizzoli. "Are you listening?"
zh_cn: “嗨，你在听我说吗？”芮黎真道。

source: She is tightly controlled, he conceded.
zh_cn: “她自控的好。”他坦承道。

source: But not ice, he thought, remembering how Catherine Cordell's hand had trembled as she gave him back the photos of the two women.
zh_cn: 但她不是冰山，他想起柯瑟琳将照片递回给他时，手在颤抖。

source: Back at his desk, he sipped luke warm Coke and re-read the article printed a few weeks before in the Boston Globe: "Women Holding the Knife."
zh_cn: 回到办公室，他在办公桌旁坐下，一边喝着不凉的可乐，一边重新阅读几周前波士顿环球报上刊登的那篇报道：“执刀的女人”。

source: It featured three female surgeons in Boston-- their triumphs and difficulties, the special problems they faced in their specialty.
zh_cn: 这篇报道讲述了波士顿三位女性外科医生，她们的成功和困境，以及在职业领域遇到的特殊问题。

source: Of the three photos, Cordell's was the most arresting.
zh_cn: 三张照片中，柯瑟琳的那张最为醒目。

source: It was more than the fact she was attractive; it was her gaze,so proud and direct that it seemed to challenge the camera.
zh_cn: 不只是因为她最漂亮，最重要是她的眼神，她的眼睛直视镜头，其中满是高傲和坦然。

source: The photo, like the article, reinforced the impression that this woman was in control of her life.
zh_cn: 这张照片和这篇文章，强化了他对她的印象：她是一个能掌控自己生活的女人。

source: He set aside the article and sat thinking of how wrong first impressions can be.
zh_cn: 他放下报纸，坐着凝思，第一印象多不可靠啊。

source: How easily pain can be masked by a smile, an upward tilting chin.
zh_cn: 痛苦可以轻易地被一个微笑、一个高昂的下巴所掩盖。

source: Now he opened a different file. Took a deep breath and reread the Savannah police report on Dr. Andrew Capra.
zh_cn: 他打开另外一份文件，深呼吸一下，准备重新阅读萨凡纳警方关于蔡德鲁医生的卷宗。

source: Capra made his first known kill while he was a senior medical student at Emory University in Atlanta.
zh_cn: 蔡德鲁犯下第一桩案子的时候，还是亚特兰大埃莫里大学医科四年级学生。

source: The victim was Dora Ciccone, a twenty-two-year-old Emory graduate student, whosebody was found tied to the bed in her off-campus apartment.
zh_cn: 受害者席朵娜，22岁，埃莫里大学研究生。在她校外公寓的床上发现了她的尸体。

source: Traces of the date-rape drug Rohypnol were found in her system on autopsy Her apartment showed no signs of forced entry.
zh_cn: 尸检发现她体内有约会强奸药氟硝安定残留，公寓无暴力闯入痕迹。

source: The victim had invited the killer into her home.
zh_cn: 是受害者放凶手进来的。

source: Once drugged, Dora Ciccone wastied to her bed with nylon cord, and her screams were muffled with duct tape.
zh_cn: 被迷晕后，席朵娜被尼龙绳绑在床上，嘴部被布基胶带缠住，叫喊声无法传出。

source: First the killer raped her. Then he proceeded to cut.
zh_cn: 凶手先强奸了她，然后又将她子宫摘除。

source: She was alive during the operation.
zh_cn: 手术期间，她还活着。

source: When he had completed the excision, and had taken his souvenir, he administered the coup de grace: a single deep slash across the neck, from left to right.
zh_cn: 他完成切除，拿走纪念品之后，实施了最后的致命一击：整个颈部从左向右，深深的一刀。

source: Though the police had DNA from the killer's semen, they had no leads.
zh_cn: 尽管警方采集到了凶手的精液，但却毫无头绪。

source: The investigation was complicatedby the fact Dora was known as a party girl who liked to cruise the local bars and often brought home men she'd only just met.
zh_cn: 因为席朵娜是个交际花，她穿梭于当地酒吧中，经常带刚认识的男人回家过夜，这让调查复杂化了。

source: On the night she died, the man she brought home was a medical student named Andrew Capra.
zh_cn: 她遇害那晚，带回家的男人是个医科学生，名叫蔡德鲁。

source: But Capra's name did not come to the attention of the police until three women had been slaughtered in the city of Savannah, two hundred miles away.
zh_cn: 但这个名字并未引起警察的注意，后来在300多公里以外的萨凡纳，又有三名女性被残杀。

source: Finally, on a muggy night in June, the killings ended.
zh_cn: 最后，终于在7月一个闷热的夜晚，杀戮被终结了。

source: Thirty-one-year-old Catherine Cordell, the chief surgical resident in Savannah's Riverland Hospital, was startled by someone knocking at her door.
zh_cn: 那时，柯瑟琳31岁，是萨凡纳河谷地医院住院总医师。那天夜里，她被敲门声惊动。

source: When she opened it, she found Andrew Capra, one of her surgery interns, standing on her porch. Earlier that day, in the hospital, she had reprimanded him about a mistake he'd made, and now he was desperate to find out how he could redeem himself. Could he please come into talk about it?
zh_cn: 开门后，她看到蔡德鲁站在门廊上，那是她手下的一位外科实习生。当天早些时候，他由于犯错，被她严厉地斥责了一番。现在他急于弥补过错，希望能进门和她谈谈。

source: Over a few beers, they'd reviewed Capra's performance as an intern.
zh_cn: 他们一边喝着啤酒，一边回顾蔡德鲁的实习表现。

source: All the errors he'd made, the patients he might have harmed because of his carelessness. She did not sugarcoat the truth: that Capra was failing and would not be allowed to finish the surgery program.
zh_cn: 他犯的所有错误，他的粗心大意可能对病人造成的伤害，她毫不留情地指出：蔡德鲁表现不合格，将不能完成外科医生培训计划。

source: At some point in the evening, Catherine left the room to use the toilet, then returned to resume the conversation and finish her beer.
zh_cn: 中途，柯瑟琳起身去洗手间，回来后继续谈话，喝完她的啤酒。

source: When she regained consciousness, she found herself stripped naked and tied to the bed with nylon cord.
zh_cn: 她醒来的时候，发现全身赤裸，被尼龙绳绑在床上。

source: The police report described, in horrifying detail, the nightmare that followed.
zh_cn: 警方卷宗描述了接下来发生的噩梦，令人战栗的细节。

source: Photographs taken of her in the hospital revealed a woman with haunted eyes, a bruised and horribly swollen cheek.
zh_cn: 照片上的她，身在医院，眼神惊恐，脸部淤紫、肿的很大。

source: What he saw, in these photos, was summed up in the generic word: victim.
zh_cn: 这些照片，可以用一个词来归类：受害者。

source: It was not a word that applied to the eerily composed woman he had met today.
zh_cn: 这个词与他今早遇到的那个异常镇静的女人一点儿也沾不上边。

source: Now, re-reading Cordell's statement, he could hear her voice in his head.
zh_cn: 此刻，再次阅读柯瑟琳的笔录，他脑海中响起了她的声音。

source: The words no longer belonged to an anonymous victim, but to a woman whose face he knew.
zh_cn: 这些文字不再属于一个陌生的受害者，而是他熟悉的面孔。

source: I don't know how I got my hand free.
zh_cn: 我不知道我的手是怎么挣脱的。

source: My wrist is all scraped now, so I must have pulled it through the cord.
zh_cn: 手腕上都是擦伤，所以可能是从绳索里硬拽出来的。

source: I'm sorry, but things aren't clear in my mind.
zh_cn: 很抱歉，我的记忆很模糊。

source: All I remember is reaching for the scalpel, knowing that I had to get the scalpel off the tray. That I had to cut the cords, before Andrew came back. . . .
zh_cn: 我只记得我拼命去够托盘上的手术刀，想在蔡德鲁回来之前，割断绳子。

source: I remember rolling toward the side of the bed. Falling half onto the floor and hitting my head.
zh_cn: 我滚到床边，半个身子掉到地板上，撞到了头。

source: Then I was trying to find the gun. It's my father's gun.
zh_cn: 然后我开始找枪，那是我父亲的。

source: After the third woman was killed in Savannah, he insisted I keep it.
zh_cn: 萨凡纳第三个女孩被杀后，他坚持要我拿着防身。

source: I remember reaching under my bed. Grabbing the gun.
zh_cn: 我伸手到床底，拿到了枪。

source: I remember footsteps, coming into the room.
zh_cn: 我听到脚步声，渐渐进入房间内。

source: Then--I'm not sure. That must be when I shot him.
zh_cn: 然后--我不太确定，我应该是开枪打中了他。

source: Yes, that's what I think happened.
zh_cn: 我想应该是这样。

source: They told me I shot him twice. I guess it must be true.
zh_cn: 他们说我开了两枪，应该是真的。

source: Moore paused, mulling over the statement.
zh_cn: 莫拓森凝视着这段笔录，思索着。

source: Ballistics had confirmed that both bullets were fired from the weapon, registered to Catherine's father, that was found lying beside the bed.
zh_cn: 弹道实验证实两颗子弹都是由这把枪射出的，它登记在柯瑟琳父亲名下，案发后放在床边。

source: Blood tests in the hospital confirmed the presence of Rohypnol, an amnesiac drug, in her blood stream, so she might very well have blank spots in her memory.
zh_cn: 验血表明她血液中有氟硝安定，这种药会导致失忆，所以她记忆中有盲点很正常。

source: When Cordell was brought to the E.R., the doctors described her as confused, either from the drug or from a possible concussion.
zh_cn: 柯瑟琳被送到急诊室时，医生说她神志恍惚，可能是药物或脑震荡所致。

source: Only a heavy blow to the head could have left such a bruised and swollen face.
zh_cn: 她脸上的淤紫和肿胀，只能是头部受到重击造成的。

source: She did not recall how or when she received that blow.
zh_cn: 但她却想不起来何时受到过这样的重击。

source: Moore turned to the crime scene photos. On the bedroom floor, Andrew Capra lay dead, flat on his back.
zh_cn: 莫拓森拿起犯罪现场照片，蔡德鲁仰面倒在卧室地板上，已经死亡。

source: He had been shot twice, once in the abdomen, once in the eye, both times at close range.
zh_cn: 他身中两枪，一枪击中了腹部，另一枪在眼部，两枪都是近距离开火。

source: For a long time he studied the photos, noting the position of Capra's body, the pattern of the blood stains.
zh_cn: 他仔细看了好一会儿，研究蔡德鲁尸体的位置和血迹图案。

source: He turned to the autopsy report. Read it through twice.
zh_cn: 他又拿起验尸报告，通读了两遍。

source: Looked once again at the crime scene photo.
zh_cn: 又再看犯罪现场照片。

source: Something is wrong here, he thought. Cordell's statement does not make sense.
zh_cn: 有什么地方不对劲，柯瑟琳的笔录有疑点。

source: A report suddenly landed on his desk.
zh_cn: 一份报告突然掉到他桌子上。

source: He glanced up, startled, to see Rizzoli.
zh_cn: 他吓了一跳，抬头一看是芮黎真。

source: Did you get a load of this? she asked.
zh_cn: “你看过这个吗？”她问道。

source: What is it?
zh_cn: “这是什么？”

source: The report on that strand of hair found in Elena Ortiz's wound margin.
zh_cn: “欧琳娜伤口边缘发现的那根头发的检验报告。”

source: Moore scanned down to the final sentence. And he said: "I have no idea what this means."
zh_cn: 莫拓森翻到报告最后一页，看了下最后一段，然后说：“这个我怎么完全看不懂。”

source: In 1997, the various branches of the Boston Police Department were moved under one roof, located inside the brand-new complex at One Schroeder Plaza in Boston's rough-and-tumble Roxbury neighborhood.
zh_cn: 1997年，波士顿警察局下属各个部门搬在了一个屋檐下，一起驻进崭新的综合大楼。

source: The cops referred to their new digs as "the marble palace" because of the extensive use of polished granite in the lobby."Give us a few years to trash the place, and it'll feel like home"was the joke.
zh_cn: 警察们讥讽地说这回住大理石宫殿里了，因为新大楼大厅里铺满了闪亮的花岗岩，还说“这地方得让我们折腾个几年，才能有个家的样子”。

source: Schroeder Plaza bore little resemblance to the shabby police stations seen on TV cop shows. It was a sleek and modern building, brightened by large windows and skylights.
zh_cn: 这里和警察剧里破旧的警察局完全不同，外观气派，充满现代感，开阔的窗户和天窗让楼内十分敞亮。

source: The homicide unit, with its carpeted floors and computer workstations, could have passed for a corporate office.
zh_cn: 凶杀科内铺着地毯，安装着电脑桌，都可以直接用来做商业公司的办公室了。

source: What the cops liked best about Schroeder Plaza was the integration of the various BPD branches.
zh_cn: 警察们最满意的一点是，局内各部门终于集中在一起了。

source: For homicide detectives, a visit to the crime lab was only a walk down the hallway, to the south wing of the building.
zh_cn: 对于凶杀科的警探们来说，要去鉴证室，只需出门沿走廊直走，进入南楼就到了。

source: In Hair and Fiber, Moore and Rizzoli watched as Erin Volchko, a forensic scientist, sifted through her collection of evidence envelopes. 'All I had to work with was that single hair,"said Erin.
zh_cn: 在毛发与纤维分析室，莫拓森和芮黎真看着法证专家武爱兰，她在一堆证据袋里翻找着。“我的工作就是研究这根头发。”爱兰说。

source: "But it's amazing what one hair can tell you.
zh_cn: “一根头发能告诉你许多事情。

source: Okay, hereit is."
zh_cn: 好的，找到了。”

source: She'd located the envelope with Elena Ortiz's case number, and now she removed a microscope slide.
zh_cn: 她找到标有欧琳娜案件编号的证据袋，拿出一片显微镜载玻片。“

source: "I'll just show you what it looks like under the lens.
zh_cn: 我给你们看一下，这根头发在显微镜中是什么样子。

source: The numerical scores are in the report."
zh_cn: 数值评分已经写入报告里了。”

source: These numbers? said Rizzoli, looking down at the long series of scoring codes on the page.
zh_cn: “这些数字？”芮黎真低头看着报告上那一长串评分编码，问道。

source: Correct.
zh_cn: “对。

source: Each code describes a different characteristic of hair, from color and curl tomicroscopic features.
zh_cn: 每个编码对应头发的一种不同特征，包括颜色、卷曲度、微观特征等等。

source: This particular strand is an A01--a dark blond. Its curlis B01. Curved, with a curl diameter of less than eighty. Almost, but not quite, straight.
zh_cn: 这根头发的颜色是A01--深金色，卷曲度是B01--弯曲的，但是卷曲直径小于80，几乎就是直发。

source: The shaft length is four centimeters.
zh_cn: 发干长4厘米。

source: Unfortunately, this strand is in its telogen phase, so there's no epithelial tissue adhering toit.
zh_cn: 不幸的是，这根头发处在休止期，上皮组织已经脱落。”

source: Meaning there's no DNA.
zh_cn: “那就是没有DNA了。”

source: Right.
zh_cn: “是的。

source: Telogen is the terminal stage of root growth.
zh_cn: 休止期的头发，发根停止生长。

source: This strand fell out naturally, as part of the shedding process.
zh_cn: 这根头发是自然脱落的，是整个脱落过程中掉发的一部分。

source: In other words, it was not yanked out.
zh_cn: 换句话说，不是被拽下来的。

source: If there were epithelial cells on the root, we could use their nuclei for DNA analysis.
zh_cn: 如果发根部有上皮细胞，我们就可以用细胞核进行DNA分析。

source: But this strand doesn't have any such cells.
zh_cn: 但这根头发不带有这样的细胞。”

source: Rizzoli and Moore exchanged looks of disappointment.
zh_cn: 芮黎真和莫拓森对看了一眼，都露出了失望的神色。

source: But, added Erin,"we do have something here that's pretty damn good.
zh_cn: “但是，”爱兰话锋一转，“还是有好消息的。

source: Not as good as DNA, but it might hold up in court once you nail a suspect.
zh_cn: 虽然不如DNA管用，但是如果你抓到了疑犯，这个可以作为有效证据，用在法庭上。

source: It's too bad we don't have any hairs from the Sterling case to compare."
zh_cn: 很遗憾，斯黛安一案中没有找到类似的头发，可供比较。”

source: She focused the microscope lens, then scooted aside. "Take a look."
zh_cn: 她把显微镜焦距调好，闪开一边，“你们来看一下吧。”

source: The scope had a teaching eye piece, so both Rizzoli and Moore could examine the slide simultaneously.
zh_cn: 这台仪器带有一个教学接目镜，所以莫拓森和芮黎真两人可以同时观察这片载玻片。

source: What Moore saw, peering through the lens, was a single strand beaded with tiny nodules.
zh_cn: 莫拓森透过镜头，看到这根头发上有许多微小的圆形突出部分，像是在头发上穿了一串珠子。

source: What are the little bumps? said Rizzoli.
zh_cn: “这些小肿包是什么？”芮黎真说。

source: "That's not normal."
zh_cn: “看起来不太正常。”

source: Not only is it abnormal,it's rare, said Erin.
zh_cn: “不只是不正常，简直是罕有。”爱兰道。

source: "It's a condition called Trichorrhexisinvaginata, otherwise known as 'bamboo hair.'
zh_cn: “这叫做结节性脆发症，俗称‘竹节发’。

source: You can see how it gets its nickname.
zh_cn: 你们应该明白这个俗称是怎么来的了吧。

source: Those little nodules make it look like a stalk of bamboo, don't they?"
zh_cn: 这些小突起，让头发看起来像是根竹子，挺像吧？”

source: What are thenodules? asked Moore.
zh_cn: “这些突起是什么？”莫拓森问道。

source: They're focal defects in the hair fiber.
zh_cn: “毛发纤维局部性缺损。

source: Weak spots which allow the hair shaft to fold back on itself, forming a sort of ball and socket.
zh_cn: 发干容易在受损点向后折回，形成球窝状。

source: Those little bumps are the weak spots, where the shaft has telescoped on itself, making a bulge.
zh_cn: 这些小突起就是受损点，发干在这些地方向发根方向挤压，就出现了一个个隆起。”

source: How do you get this condition?
zh_cn: “这种病症是怎么形成的？”

source: Dyes, permanents, that sort of thing.
zh_cn: “经常烫染头发，有时会产生这种状况。
